Documents/ПР_ДПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДПП</Name>
			<BasedOn>
				<xr:Item>Document.ПР_ДоговорДолевогоУчастия</xr:Item>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_ДоговорОтделки</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
				<xr:Item>Document.ПР_ДоговорОснащения</xr:Item>
				<xr:Item>Document.ПР_ДПП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПР_ПричинаПередачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОтделки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_ДПП/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		Организация = ДанныеЗаполнения.Организация;
		СтарыйКонтрагент = ДанныеЗаполнения.Контрагент;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") Тогда    
			Помещение = ДанныеЗаполнения.ОбъектыАренды[0].ОбъектАренды;
		Иначе
			Помещение = ДанныеЗаполнения.Помещение;  
		КонецЕсли;
		СтарыйДоговор = ДанныеЗаполнения.Ссылка; 
		Дата = ТекущаяДата(); 
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СД = СтарыйДоговор.ПолучитьОбъект();
	Если ТипЗНЧ(СД) = Тип("ДокументОбъект.АР17_ЗаключениеАгентскогоДоговора") Тогда
		СД.ДатаОкончания = ДатаРегистрации;
		СД.ОбъектыАренды[0].ДатаВозврата = ДатаРегистрации;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры
